package cn.futures.data.importor.crawler.weatherCrawler;

import java.util.Arrays;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class WeatherParamsMap {
	public static Map<String, String> code2stateMap = new HashMap<String, String>(){
		{
			put("IL","伊利诺斯州");
			put("VA","弗吉尼亚州");
			put("WY","怀俄明州");
			put("TN","田纳西州");
			put("TX","德克萨斯州");
			put("PA","宾夕法尼亚州");
			put("UT","犹他州");
			put("MS","密西西比州");
			put("OH","俄亥俄州");
			put("SD","南达科他州");
			put("NJ","新泽西州");
			put("NY","纽约州");
			put("RI","罗德岛州");
			put("KY","肯塔基州");
			put("ND","北达科他州");
			put("MT","蒙大拿州");
			put("NM","新墨西哥州");
			put("NE","内布拉斯加州");
			put("NV","内华达州");
			put("MO","密苏里州");
			put("AK","阿拉斯加州");
			put("DC","华盛顿特区");
			put("IA","爱荷华州");
			put("KS","堪萨斯州");
			put("CA","加利福尼亚州");
			put("HI","夏威夷州");
			put("NC","北卡罗来纳州");
			put("LA","路易斯安那州");
			put("IN","印地安纳州");
			put("CT","康涅狄格州");
			put("FL","佛罗里达州");
			put("GA","乔治亚州");
			put("OR","俄勒冈州");
			put("MD","马里兰州");
			put("SC","南卡罗来纳州");
			put("WI","威斯康辛州");
			put("DE","德拉瓦州");
			put("MN","明尼苏达州");
			put("OK","俄克拉荷马州");
			put("AZ","亚历桑那州");
			put("VT","佛蒙特州");
			put("AR","阿肯萨斯州");
			put("WA","华盛顿州");
			put("ID","爱德华州");
			put("ME","缅因州");
			put("AL","阿拉巴马州");
			put("WV","西弗吉尼亚州");
			put("CO","科罗拉多州");
			put("MA","马萨诸塞州");
			put("NH","新罕布什尔州");
			put("MI","密西根州");
		}
	};
	
	public static Map<String, String> city_map = new HashMap<String, String>(){
		{
			put("AL-BIRMINGHAM","伯明翰");
			put("AL-HUNTSVILLE","亨茨维尔");
			put("AL-MOBILE","莫比尔");
			put("AL-MONTGOMERY","蒙哥马利");
			put("AK-ANCHORAGE","安克雷奇");
			put("AK-BARROW","巴罗");
			put("AK-FAIRBANKS","费尔班克斯");
			put("AK-JUNEAU","朱诺");
			put("AK-KODIAK","科迪亚克");
			put("AK-NOME","诺姆");
			put("AZ-FLAGSTAFF","弗拉格斯塔夫");
			put("AZ-PHOENIX","菲尼克斯");
			put("AZ-PRESCOTT","普雷斯科特");
			put("AZ-TUCSON","图森");
			put("AR-FORTSMITH","史密斯堡");
			put("AR-LITTLEROCK","小岩城");
			put("CA-BAKERSFIELD","贝克斯菲尔德");
			put("CA-FRESNO","弗雷斯诺");
			put("CA-LOSANGELES","洛杉矶");
			put("CA-REDDING","雷丁");
			put("CA-SACRAMENTO","萨克拉门托");
			put("CA-SANDIEGO","圣地亚哥");
			put("CA-SANFRANCISCO","旧金山");
			put("CA-STOCKTON","斯托克顿");
			put("CO-ALAMOSA","阿拉莫萨");
			put("CO-COSPRINGS","斯普林斯");
			put("CO-DENVERINTL","丹佛");
			put("CO-GRANDJUNCTION","大章克申");
			put("CO-PUEBLO","普韦布洛");
			put("CT-BRIDGEPORT","布里奇波特");
			put("CT-HARTFORD","哈特福德");
			put("DC-WASHINGTON","华盛顿");
			put("DE-WILMINGTON","威明顿市");
			put("FL-DAYTONABEACH","代托纳比奇");
			put("FL-JACKSONVILLE","杰克逊维尔");
			put("FL-KEYWEST","基韦斯特");
			put("FL-MIAMI","迈阿密");
			put("FL-ORLANDO","奥兰多");
			put("FL-PENSACOLA","彭萨科拉");
			put("FL-TALLAHASSEE","塔拉哈西");
			put("FL-TAMPA","坦帕市");
			put("FL-WESTPALMBEACH","西棕榈滩");
			put("GA-ATHENS","阿森斯");
			put("GA-ATLANTA","亚特兰大");
			put("GA-AUGUSTA","奥古斯塔");
			put("GA-COLUMBUS","哥伦布");
			put("GA-MACON","梅肯");
			put("GA-SAVANNAH","萨凡纳");
			put("HI-HILO","希洛");
			put("HI-HONOLULU","檀香山");
			put("HI-KAHULUI","卡胡卢伊");
			put("HI-LIHUE","利胡埃");
			put("ID-BOISE","博伊西");
			put("ID-LEWISTON","刘易斯顿");
			put("ID-POCATELLO","波卡特洛");
			put("IL-CHICAGOOHARE","芝加哥/奥黑尔");
			put("IL-MOLINE","莫林");
			put("IL-PEORIA","皮奥里亚");
			put("IL-ROCKFORD","罗克福德");
			put("IL-SPRINGFIELD","斯普林菲尔德");
			put("IN-EVANSVILLE","埃文斯维尔");
			put("IN-FORTWAYNE","韦恩堡");
			put("IN-INDIANAPOLIS","印第安纳波利斯");
			put("IN-SOUTHBEND","南本德");
			put("IA-BURLINGTON","伯灵顿");
			put("IA-CEDARRAPIDS","锡达拉皮兹");
			put("IA-DESMOINES","得梅因");
			put("IA-DUBUQUE","迪比克");
			put("IA-SIOUXCITY","苏城");
			put("IA-WATERLOO","滑铁卢");
			put("KS-CONCORDIA","坎科底亚");
			put("KS-DODGECITY","道奇城");
			put("KS-GOODLAND","古德兰");
			put("KS-TOPEKA","托皮卡");
			put("KS-WICHITA","威奇托");
			put("KY-JACKSON","杰克逊");
			put("KY-LEXINGTON","列克星敦");
			put("KY-LOUISVILLE","路易斯维尔");
			put("KY-PADUCAH","帕迪尤卡");
			put("LA-BATONROUGE","巴吞鲁日");
			put("LA-LAKECHARLES","莱克查尔斯");
			put("LA-NEWORLEANS","新奥尔良");
			put("LA-SHREVEPORT","什里夫波特");
			put("ME-CARIBOU","卡里布");
			put("ME-PORTLAND","波特兰");
			put("MD-BALTIMORE","巴尔的摩");
			put("MA-BOSTON","波士顿");
			put("MA-WORCESTER","伍斯特");
			put("MI-ALPENA","阿尔皮纳");
			put("MI-GRANDRAPIDS","大急流城");
			put("MI-HOUGHTONLAKE","霍顿湖");
			put("MI-LANSING","兰辛");
			put("MI-MUSKEGON","马斯基根");
			put("MI-TRAVERSECITY","特拉弗斯城");
			put("MN-DULUTH","德卢斯");
			put("MN-INTLFALLS","国际瀑布");
			put("MN-MINNEAPOLIS","明尼阿波利斯");
			put("MN-ROCHESTER","罗切斯特");
			put("MN-STCLOUD","克劳德");
			put("MS-JACKSON","杰克逊");
			put("MS-MERIDIAN","默里迪恩");
			put("MS-TUPELO","图珀洛");
			put("MO-COLUMBIA","哥伦比亚");
			put("MO-KANSASCITY","堪萨斯城");
			put("MO-SAINTLOUIS","圣路易斯");
			put("MO-SPRINGFIELD","斯普林菲尔德");
			put("MT-BILLINGS","比灵斯");
			put("MT-BUTTE","巴特");
			put("MT-CUTBANK","卡特班克");
			put("MT-GLASGOW","格拉斯哥");
			put("MT-GREATFALLS","大瀑布城");
			put("MT-HAVRE","勒阿弗尔");
			put("MT-MISSOULA","米苏拉");
			put("NE-GRANDISLAND","格兰德岛");
			put("NE-LINCOLN","林肯");
			put("NE-NORFOLK","诺福克");
			put("NE-NORTHPLATTE","北普拉特");
			put("NE-OMAHA","奥马哈");
			put("NE-SCOTTSBLUFF","斯科茨布拉夫");
			put("NE-VALENTINE","瓦伦丁");
			put("NV-ELY","伊利");
			put("NV-LASVEGAS","拉斯维加斯");
			put("NV-RENO","里诺");
			put("NV-WINNEMUCCA","温尼马卡");
			put("NH-CONCORD","康科德");
			put("NJ-NEWARK","纽瓦克");
			put("NM-ALBUQUERQUE","阿尔伯克基");
			put("NY-ALBANY","奥尔巴尼");
			put("NY-BINGHAMTON","宾厄姆顿");
			put("NY-BUFFALO","布法罗（水牛城）");
			put("NY-ROCHESTER","罗切斯特");
			put("NY-SYRACUSE","锡拉丘兹");
			put("ND-BISMARCK","俾斯麦");
			put("ND-DICKINSON","迪金森");
			put("ND-FARGO","法戈");
			put("ND-GRANDFORKS","大福克斯");
			put("ND-JAMESTOWN","詹姆斯敦");
			put("ND-WILLISTON","威利斯顿");
			put("NC-ASHEVILLE","阿什维尔");
			put("NC-CHARLOTTE","夏洛特");
			put("NC-GREENSBORO","格林斯博罗");
			put("NC-HATTERAS","哈特勒斯");
			put("NC-RALEIGH","罗利");
			put("NC-WILMINGTON","威明顿");
			put("OH-AKRONCANTON","阿克伦城");
			put("OH-CINCINNATI","辛辛那提");
			put("OH-CLEVELAND","克利夫兰");
			put("OH-COLUMBUS","哥伦布");
			put("OH-DAYTON","代顿");
			put("OH-MANSFIELD","曼斯菲尔德");
			put("OH-TOLEDO","托莱多");
			put("OH-YOUNGSTOWN","扬斯敦");
			put("OK-OKLAHOMACITY","俄克拉何马城");
			put("OK-TULSA","塔尔萨");
			put("OR-ASTORIA","阿斯托利亚");
			put("OR-BURNS","伯恩斯");
			put("OR-EUGENE","尤金");
			put("OR-MEDFORD","梅德福");
			put("OR-PENDLETON","彭德尔顿");
			put("OR-PORTLAND","波特兰");
			put("OR-SALEM","塞勒姆");
			put("RI-PROVIDENCE","普罗维登斯");
			put("SD-ABERDEEN","阿伯丁");
			put("SD-HURON","休伦湖");
			put("SD-RAPIDCITY","拉皮特城");
			put("SD-SIOUXFALLS","苏福尔斯");
			put("SC-BEAUFORT","博福特");
			put("SC-CHARLESTON","查尔斯顿");
			put("SC-COLUMBIA","哥伦比亚");
			put("SC-GREENVILLE","格林威尔");
			put("WY-CASPER","卡斯伯");
			put("WY-CHEYENNE","夏延");
			put("WY-LANDER","兰德");
			put("WY-SHERIDAN","谢里登");
			put("PA-ALLENTOWN","艾伦镇");
			put("PA-ERIE","伊利");
			put("PA-MIDDLETOWN","米德尔顿");
			put("PA-PHILADELPHIA","费城");
			put("PA-PITTSBURGH","匹兹堡");
			put("PA-WILKESBARRE","威尔克斯-巴里");
			put("PA-WILLIAMSPORT","威廉斯波特");
			put("TX-ABILENE","阿比林");
			put("TX-AMARILLO","阿马里洛");
			put("TX-AUSTIN","奥斯汀");
			put("TX-BEAUMONT","博蒙特");
			put("TX-BROWNSVILLE","布朗斯维尔");
			put("TX-CORPUSCHRISTI","科珀斯克里斯蒂");
			put("TX-DELRIO","德尔里奥");
			put("TX-ELPASO","厄尔巴索");
			put("TX-FORTWORTH","沃斯堡");
			put("TX-GALVESTON","加尔维斯顿");
			put("TX-HOUSTON","休斯顿");
			put("TX-LUBBOCK","卢博克市");
			put("TX-MIDLAND","米德兰");
			put("TX-SANANGELO","圣安吉洛");
			put("TX-SANANTONIO","圣安东尼奥");
			put("TX-VICTORIA","维多利亚");
			put("TX-WACO","韦科");
			put("TX-WICHITAFALLS","威奇托福尔斯");
			put("VT-BURLINGTON","伯灵顿");
			put("TN-BRISTOL","布里斯托尔");
			put("TN-CHATTANOOGA","查塔努加");
			put("TN-KNOXVILLE","诺克斯维尔");
			put("TN-MEMPHIS","孟菲斯");
			put("TN-NASHVILLE","纳什维尔");
			put("UT-SALTLAKECITY","盐湖城");
			put("WI-EAUCLAIRE","欧克莱尔");
			put("WI-GREENBAY","（格林湾）绿湾");
			put("WI-LACROSSE","拉克罗斯");
			put("WI-MADISON","麦迪逊");
			put("WI-MILWAUKEE","密尔沃基");
			put("WA-OLYMPIA","奥林匹亚");
			put("WA-QUILLAYUTE","奎利特");
			put("WA-SEATTLETACOMA","西雅图-塔科马");
			put("WA-SPOKANE","斯波坎市");
			put("WA-YAKIMA","雅吉瓦");
			put("WV-BECKLEY","贝克利");
			put("WV-CHARLESTON","查尔斯顿");
			put("WV-ELKINS","埃尔金斯");
			put("WV-HUNTINGTON","亨廷顿");
			put("VA-LYNCHBURG","林奇堡");
			put("VA-NORFOLK","诺福克");
			put("VA-RICHMOND","里士满");
			put("VA-ROANOKE","罗诺克");
			put("VA-WASHDULLES","杜勒斯");
		}
	};
	public static Map<String, String> yunn_city_map = new HashMap<String, String>(){
		{
			
		}
	};
	public static Map<String, String> neim_city_map = new HashMap<String, String>(){
		{
			
		}
	};
	public static Map<String, String> beij_city_map = new HashMap<String, String>(){
		{
			
		}
	};
	
	public static Map<String, Map<String, String>> rp5_China_his_weather_prov = new HashMap<String, Map<String, String>> (){
		{
//			put("云南", yunn_city_map);
//			put("内蒙古", neim_city_map);
//			put("北京", beij_city_map);
//			put("吉林", yunn_city_map);
//			put("四川", yunn_city_map);
//			put("天津", yunn_city_map);
//			put("宁夏", ningx_city_map);
//			put("安徽", anw_city_map);
//			put("上海", yunn_city_map);
//			put("山东", yunn_city_map);
//			put("山西", yunn_city_map);
//			put("广东", guangd_city_map);
//			put("广西", yunn_city_map);
//			put("新疆", xinj_city_map);
//			put("江苏", yunn_city_map);
//			put("江西", jiangx_city_map);
//			put("河北", yunn_city_map);
//			put("河南", yunn_city_map);
//			put("浙江", zhej_city_map);
//			put("海南", yunn_city_map);
//			put("湖北", yunn_city_map);
//			put("湖南", yunn_city_map);
//			put("甘肃", yunn_city_map);
//			put("福建", yunn_city_map);
			put("西藏", yunn_city_map);
//			put("贵州", guizh_city_map);
//			put("辽宁", yunn_city_map);
//			put("重庆", yunn_city_map);
//			put("陕西", yunn_city_map);
//			put("青海", yunn_city_map);
//			put("黑龙江", yunn_city_map);
		}
	};
	public static List<String> China_his_weather_cities = Arrays.asList(
			"北京历史天气","承德市历史天气","唐山市历史天气","沙城镇历史天气","大阁镇历史天气",
			
			"乌鲁木齐市历史天气","奇台镇历史天气","巴仑台历史天气",
			
			"广州(机场)历史天气","氹仔(机场)历史天气","流浮山历史天气","双江镇历史天气","长宁镇历史天气","梅县历史天气","汕头市历史天气",
			"武冈市历史天气","郴州市历史天气","韶关市历史天气","岭坡乡历史天气","元善镇历史天气","八弓镇历史天气","河源历史天气",
			"汕尾市历史天气","石角镇历史天气","信宜市历史天气","桂林(机场)历史天气","河池市历史天气","湛江历史天气","赣州市历史天气",
			"深圳市历史天气","上川镇历史天气","阳江市历史天气","漳平市历史天气","梧州市历史天气","高要市历史天气","北海市历史天气",
			"海口市历史天气","東沙環历史天气","这匮哩嗯历史天气",
			
			"嵊州市历史天气","南浦街道历史天气","东岙村历史天气","杭州市(机场)历史天气","湖北城关镇历史天气","石浦镇历史天气","丽水市历史天气",
			"溧阳市历史天气","宝山区历史天气","珍岛历史天气","衢州市历史天气","牯岭震历史天气","武冈市历史天气","菜园镇历史天气",
			"温州市历史天气","兰屿乡历史天气","福鼎市历史天气","大陈岛历史天气",
			
			"西乌珠穆沁历史天气","扎门乌德历史天气","阿尔山市历史天气","扎鲁特历史天气","鄂托克历史天气","泰山区历史天气",
			"大同市历史天气","赤峰市历史天气","别力古台历史天气","围场镇历史天气","Erdenetsagaan历史天气",
			"那仁宝拉格苏木所属各嘎查历史天气","呼和浩特市历史天气","银川市历史天气","曼陀罗历史天气","林顿历史天气",
			"承德市历史天气","临河历史天气","华阳乡历史天气","林西镇历史天气","新体路街道历史天气","花马池镇历史天气",
			"锡林浩特历史天气","文笔镇历史天气","二连浩特历史天气","东乌珠穆沁历史天气","榆林市历史天气","长顺镇历史天气",
			"多伦淖尔镇历史天气","朱日和镇历史天气","天骄路街道历史天气","宝国吐(气象站54226)历史天气",
			"乌拉特中旗历史天气","朝阳市历史天气","达尔罕茂明安历史天气",
			
			"银川市历史天气","宁安镇历史天气","花马池镇历史天气",
			
			"蒙山镇历史天气","南宁市(机场)历史天气","八弓镇历史天气","钦州市历史天气","柳州市历史天气","古州镇历史天气",
			"徐家井街道历史天气","北海市历史天气","桂林(机场)历史天气","武冈市历史天气","双江镇历史天气","城厢镇历史天气",
			"桂平市历史天气",
			
			"义宁镇历史天气","莲塘镇历史天气","郴州市历史天气","湖北城关镇历史天气","武夷山市历史天气","盱江镇历史天气",
			"长宁镇历史天气","宜春市(气象站)历史天气","牯岭震历史天气","衢州市历史天气","武冈市历史天气","汀州镇历史天气",
			"邵武市历史天气","韶关市历史天气","赣州市历史天气","安庆市历史天气","元善镇历史天气","南浦街道历史天气",
			"岭坡乡历史天气","建昌镇历史天气","景德镇市历史天气","八弓镇历史天气","邵阳市历史天气","双江镇历史天气","敦厚镇历史天气",
			
			"枣阳市历史天气","义宁镇历史天气","湖北城关镇历史天气","芜湖历史天气","麻城市历史天气","固始县城关镇历史天气",
			"武夷山市历史天气","蚌埠市历史天气","衡山镇历史天气","衢州市历史天气","牯岭震历史天气","徐州历史天气",
			"汀州镇历史天气","安庆市历史天气","凤城镇历史天气","泉河、三泉、王营村历史天气","南浦街道历史天气",
			"杭州市(机场)历史天气","北关区历史天气","淮安市历史天气","溧阳市历史天气","南京市(机场)历史天气",
			"景德镇市历史天气","合肥,柳钢(机场)历史天气","信阳市历史天气",
			
			"龙坪镇历史天气","兴仁县城关镇历史天气","泸州市历史天气","贵阳市历史天气","思唐镇历史天气","八弓镇历史天气",
			"独山县城关镇历史天气","重庆,九龙坡(机场)历史天气","桃花源镇历史天气","毕节地历史天气",
			
			"金珠镇历史天气","阆中市历史天气","元马镇历史天气","南外镇历史天气","宝鸡市历史天气","泸州市历史天气",
			"陇南市历史天气","进安镇历史天气","陀陀浩历史天气","四川城关镇历史天气","昭通市历史天气","更庆镇历史天气",
			"华家岭乡历史天气","鲜水镇历史天气","高桥,内江历史天气","马尔康历史天气","升平镇历史天气","成都市（AWS)历史天气",
			"贵阳市历史天气","丽江历史天气","呷尔镇历史天气","万源市历史天气","草海镇历史天气","康定历史天气",
			"宜宾(气象站56492)历史天气","夏邛镇历史天气","色柯镇历史天气","思唐镇历史天气","西昌历史天气","雅安市历史天气",
			"结古镇历史天气","峨眉山市历史天气","梁山街道历史天气","独山县城关镇历史天气","达扎寺镇历史天气","玛查里镇历史天气",
			"重庆,九龙坡(机场)历史天气","桃花源镇历史天气","合作历史天气","吉迈镇历史天气","南充市历史天气","甘孜镇历史天气",
			"绵阳市历史天气","汉中历史天气","高城镇历史天气","毕节地历史天气","金钟镇历史天气",
			
			"泰山区历史天气","日照市历史天气","兖州市历史天气","朝城镇历史天气","龙须岛镇历史天气","潍坊市历史天气",
			"临沂市历史天气","孙武街道历史天气","海阳市历史天气","南麻镇历史天气","青口镇历史天气","箕城镇历史天气",
			"天中街道历史天气","龙口市历史天气","青岛市历史天气","徐州历史天气","安德街道历史天气","济南市历史天气",
			"南长山镇历史天气","泊头市历史天气",
			
			"哈尔滨(机场)历史天气","通辽市历史天气","临江市历史天气","延边朝鲜州历史天气","泰来镇历史天气","成岗历史天气",
			"通化市历史天气","扎鲁特历史天气","前郭镇历史天气","长白镇历史天气","长岭经济开发区历史天气","尚志市历史天气",
			"清原镇历史天气","长春市(机场)历史天气","绥芬河市历史天气","敦化市历史天气","江界市历史天气","Posyet历史天气",
			"惠山市历史天气","桦甸市历史天气","四平市历史天气",
			
			"梅县历史天气","厦门市(气象站)历史天气","汀州镇历史天气","武夷山市历史天气","Tancheng历史天气","南平市历史天气",
			"双江镇历史天气","鹏基于历史天气","漳平市历史天气","武冈市历史天气","盱江镇历史天气","南浦街道历史天气","恩施市历史天气",
			"台中历史天气","兰屿乡历史天气","Jiuxian_Shan历史天气","湖北城关镇历史天气","牯岭震历史天气","永安市历史天气",
			"八弓镇历史天气","汕头市历史天气","福州市历史天气","长宁镇历史天气","邵武市历史天气","珍岛历史天气","福鼎市历史天气",
			
			"泰山区历史天气","延安市历史天气","凤城镇历史天气","张家口市历史天气","台山镇历史天气","长顺镇历史天气","凤山街道历史天气",
			"华阳乡历史天气","大同市历史天气","文笔镇历史天气","太原市(机场)历史天气","介休市历史天气","新体路街道历史天气",
			"榆林市历史天气","天骄路街道历史天气","孟津县城关镇历史天气","运城市历史天气","箕城镇历史天气","卢氏县城关镇历史天气",
			"原平市历史天气","蔚州镇历史天气",
			
			"华家岭乡历史天气","合作历史天气","延安市历史天气","马鬃山历史天气","酒泉市历史天气","玉门市历史天气","三雷镇历史天气",
			"宝鸡市历史天气","庆阳市历史天气","西宁市历史天气","华阳乡历史天气","达扎寺镇历史天气","宁安镇历史天气","南街街道历史天气",
			"德令哈市历史天气","兰州市历史天气","平凉市历史天气","花马池镇历史天气","敦煌市历史天气","天水市历史天气","天祝藏族自治历史天气",
			
			"唐山市历史天气","石家庄市历史天气","乐亭镇历史天气","天津市历史天气","张家口市历史天气","长顺镇历史天气","沙城镇历史天气",
			"安阳市历史天气","大同市历史天气","邢台市历史天气","太原市(机场)历史天气","大阁镇历史天气","新体路街道历史天气",
			"朝城镇历史天气","承德市历史天气","保定市历史天气","青龙镇历史天气","箕城镇历史天气","北京历史天气","安德街道历史天气",
			"多伦淖尔镇历史天气","围场镇历史天气","原平市历史天气","泊头市历史天气","蔚州镇历史天气",
			
			"泉河、三泉、王营村历史天气","延安市历史天气","北关区历史天气","固始县城关镇历史天气","驻马店历史天气","凤城镇历史天气",
			"信阳市历史天气","娲城街道历史天气","枣阳市历史天气","徐州历史天气","郑州历史天气","安阳市历史天气","光化乡历史天气",
			"介休市历史天气","朝城镇历史天气","孟津县城关镇历史天气","南阳历史天气","运城市历史天气","天中街道历史天气",
			"卢氏县城关镇历史天气","麻城市历史天气",
			
			"莲塘镇历史天气","岭坡乡历史天气","岳阳历史天气","安庆市历史天气","义宁镇历史天气","澧源镇历史天气","万源市历史天气",
			"梁山街道历史天气","信阳市历史天气","宝鸡市历史天气","枣阳市历史天气","庆阳市历史天气","恩施市历史天气","南浦街道历史天气",
			"华阳乡历史天气","江陵历史天气","光化乡历史天气","湖北城关镇历史天气","牯岭震历史天气","武汉市(机场)历史天气",
			"贵阳市历史天气","宜昌市历史天气","钟祥市历史天气","桃花源镇历史天气","永安镇历史天气","卢氏县城关镇历史天气",
			"衡山镇历史天气","景德镇市历史天气","麻城市历史天气","安康市历史天气",
			
			"岭坡乡历史天气","郴州市历史天气","岳阳历史天气","芷江镇历史天气","双江镇历史天气","义宁镇历史天气","武冈市历史天气",
			"澧源镇历史天气","赣州市历史天气","邵阳市历史天气","思唐镇历史天气","恩施市历史天气","徐家井街道历史天气","常德市历史天气",
			"江陵历史天气","牯岭震历史天气","八弓镇历史天气","宜昌市历史天气","沅陵镇历史天气","宜春市(气象站)历史天气","桃花源镇历史天气",
			"韶关市历史天气","毕节地历史天气","长宁镇历史天气","连州市历史天气","桂林(机场)历史天气","敦厚镇历史天气","星沙街道历史天气",
			
			"儋州市历史天气","南沙岛历史天气","三亚市(气象站)历史天气","东方市历史天气","琼海历史天气","海口市历史天气","珊瑚岛历史天气",
			
			"昆明市历史天气","莲城镇历史天气","丽江历史天气","城厢镇历史天气","茶坝历史天气","Boun_Neua历史天气","金珠镇历史天气",
			"耕东历史天气","勐腊镇历史天气","保山历史天气","昭通市历史天气","瑞丽市历史天气","西昌历史天气","腾冲(机场)历史天气",
			"约改镇历史天气","勐朗镇历史天气","楚雄市历史天气","澧江镇历史天气","夏邛镇历史天气","城邑乡历史天气","泸州市历史天气",
			"四川城关镇历史天气","升平镇历史天气","百色市历史天气","山罗历史天气","琅南塔历史天气","西平镇历史天气","呷尔镇历史天气",
			"元马镇历史天气","老街历史天气","贵阳市历史天气","勐烈镇历史天气","耿马镇历史天气","草海镇历史天气","景洪市历史天气",
			"兴仁县城关镇历史天气","蒙自市历史天气","雅安市历史天气","毕节地历史天气","峨眉山市历史天气","思茅镇历史天气",
			"金钟镇历史天气","普保镇历史天气","宜宾(气象站56492)历史天气","中枢镇历史天气","临沧历史天气",
			
			"斯米多维奇历史天气","泰来镇历史天气","宝清镇历史天气","盘羊历史天气","伊春市历史天气","克山镇历史天气","肖埃尔戈历史天气",
			"绥芬河市历史天气","奥布卢奇耶历史天气","敦化市历史天气","孙吴镇历史天气","哈尔滨(机场)历史天气","比罗比詹历史天气",
			"通河镇历史天气","鸡西市历史天气","呼玛镇历史天气","Yekaterino-Nikolskoye历史天气","海伦市历史天气",
			"虎林市历史天气","比金历史天气","前郭镇历史天气","牡丹江市历史天气","黑河市历史天气","Turiy?Rog历史天气",
			"达利涅列琴斯克历史天气","富锦市历史天气","尚志市历史天气","Pogranichny历史天气","Chernyayevo历史天气",
			"海兰泡(气象站)历史天气","嫩江农场历史天气","Poyarkovo历史天气","齐齐哈尔(机场)历史天气","安达市历史天气",
			
			"通化市历史天气","丹东历史天气","新义州市历史天气","沈阳市历史天气","清原镇历史天气","朝阳市历史天气","水丰历史天气",
			"赤峰市历史天气","四平市历史天气","宝国吐(气象站54226)历史天气","本溪市历史天气","锦州市历史天气","彰武镇历史天气",
			"宽甸镇历史天气","大连市(机场)历史天气","青龙镇历史天气","营口市历史天气",
			
			"合作历史天气","西宁市历史天气","天祝藏族自治历史天气",
			
			"华家岭乡历史天气","延安市历史天气","凤城镇历史天气","万源市历史天气","宝鸡市历史天气","庆阳市历史天气","凤山街道历史天气",
			"华阳乡历史天气","湖北城关镇历史天气","文笔镇历史天气","榆林市历史天气","西安历史天气","天骄路街道历史天气","汉中历史天气",
			"平凉市历史天气","花马池镇历史天气","运城市历史天气","卢氏县城关镇历史天气","陇南市历史天气","安康市历史天气","天水市历史天气",
			
			"吕北乡历史天气","菜园镇历史天气","宝山区历史天气",
			
			"万源市历史天气","永安镇历史天气","岭坡乡历史天气","澧源镇历史天气","南外镇历史天气","陇南市历史天气","泸州市历史天气",
			"宝鸡市历史天气","思唐镇历史天气","天水市历史天气","梁山街道历史天气","重庆,九龙坡(机场)历史天气","桃花源镇历史天气",
			"南充市历史天气","高桥,内江历史天气","毕节地历史天气","华阳乡历史天气","贵阳市历史天气","恩施市历史天气",
			
			"天津市历史天气","北京历史天气","唐山市历史天气",
			
			"夏邛镇历史天气","下司马镇历史天气","陀陀浩历史天气","申扎镇历史天气","协格尔镇历史天气","狮泉河历史天气","丁青镇历史天气",
			"日喀则地历史天气","隆子镇历史天气","甘孜镇历史天气","拉萨历史天气","普保镇历史天气","约改镇历史天气","八一镇历史天气",
			"昌都地历史天气","那曲地历史天气","高城镇历史天气","亚拉镇历史天气");
}
